In [1]:
import pandas as pd
import numpy as np
import os
import re

# Set working directory
if not "/data/tables" in os.getcwd():
    os.chdir("../data/tables")

from pyspark.sql import SparkSession
from pyspark.shell import spark
from pyspark.sql import SQLContext
from pyspark.sql.functions import *
import matplotlib.pyplot as plt

spark = (
    SparkSession.builder.appName("MAST30034 Project 2")
    .config("spark.sql.repl.eagerEval.enabled", True) 
    .config("spark.sql.parquet.cacheMetadata", "true")
    .config("spark.sql.session.timeZone", "Etc/UTC")
    .config("spark.driver.memory", "4g")
    .getOrCreate()
)

Welcome to
      ____              __
     / __/__  ___ _____/ /__
    _\ \/ _ \/ _ `/ __/  '_/
   /__ / .__/\_,_/_/ /_/\_\   version 3.3.0
      /_/

Using Python version 3.9.12 (main, Apr  4 2022 05:22:27)
Spark context Web UI available at http://192.168.1.6:4042
Spark context available as 'sc' (master = local[*], app id = local-1662700368630).
SparkSession available as 'spark'.

In [38]:
# Read csv file
consumer = spark.read.option("delimiter", "|").csv('tbl_consumer.csv', header = True)
consumer_postcode = consumer.drop("name","address")
consumer_postcode

+-----+--------+-----------+-----------+
|state|postcode|     gender|consumer_id|
+-----+--------+-----------+-----------+
|   WA|    6935|     Female|    1195503|
|  NSW|    2782|     Female|     179208|
|   NT|     862|     Female|    1194530|
|  NSW|    2780|     Female|     154128|
|   WA|    6355|     Female|     712975|
|  NSW|    2033|     Female|     407340|
|  QLD|    4606|     Female|     511685|
|   WA|    6056|       Male|     448088|
|  NSW|    2482|     Female|     650435|
|  VIC|    3220|     Female|    1058499|
|  VIC|    3063|Undisclosed|     428325|
|   WA|    6743|     Female|    1494640|
|  QLD|    4673|     Female|    1146717|
|  VIC|    3332|       Male|    1343547|
|  QLD|    4512|       Male|    1463076|
|  NSW|    2452|       Male|    1356405|
|  VIC|    3719|     Female|    1331093|
|  NSW|    1109|       Male|      80965|
|  TAS|    7276|     Female|    1226530|
|  VIC|    3234|Undisclosed|    1390367|
+-----+--------+-----------+-----------+
only showing top 20 rows

In [39]:
consumer_postcode = consumer_postcode.toPandas()
consumer_postcode

       state postcode       gender consumer_id
0         WA     6935       Female     1195503
1        NSW     2782       Female      179208
2         NT      862       Female     1194530
3        NSW     2780       Female      154128
4         WA     6355       Female      712975
...      ...      ...          ...         ...
499994   QLD     4400       Female     1385608
499995   VIC     3097  Undisclosed     1466964
499996   NSW     2756  Undisclosed     1253484
499997   VIC     3989       Female      175005
499998   NSW     1755       Female      746835

[499999 rows x 4 columns]

In [43]:
consumer_postcode["postcode"] = consumer_postcode["postcode"].apply(lambda x : int(x))

       state  postcode       gender consumer_id
0         WA      6935       Female     1195503
1        NSW      2782       Female      179208
2         NT       862       Female     1194530
3        NSW      2780       Female      154128
4         WA      6355       Female      712975
...      ...       ...          ...         ...
499994   QLD      4400       Female     1385608
499995   VIC      3097  Undisclosed     1466964
499996   NSW      2756  Undisclosed     1253484
499997   VIC      3989       Female      175005
499998   NSW      1755       Female      746835

[499999 rows x 4 columns]

In [46]:
import pandas as pd
import io
import requests
url="https://www.matthewproctor.com/Content/postcodes/australian_postcodes.csv"
s=requests.get(url).content
df=pd.read_csv(io.StringIO(s.decode('utf-8')))
sa2_code = df[['postcode','SA2_MAINCODE_2016']]
sa2_code.rename(columns = {'SA2_MAINCODE_2016':'SA2_code'},inplace=True)
sa2_code = sa2_code.drop_duplicates()

sa2_code

C:\Users\tommy\AppData\Local\Temp\ipykernel_34988\1760603226.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sa2_code.rename(columns = {'SA2_MAINCODE_2016':'SA2_code'},inplace=True)

       postcode     SA2_code
0           200  801051049.0
2           800  701011002.0
4           801  701011002.0
5           804  701011007.0
6           810  701021010.0
...         ...          ...
18437      9013  305011105.0
18438      9015  305011105.0
18439      9464  302031038.0
18440      9726  309101268.0
18441      9999  206041122.0

[5588 rows x 2 columns]

In [32]:
income = pd.read_csv("./SA2/AUS/2021Census_G02_AUST_SA2.csv")
income = income[['SA2_CODE_2021','Median_age_persons','Median_tot_prsnl_inc_weekly']]
income.rename(columns = {'SA2_CODE_2021':'SA2_code'},inplace=True)
income

       SA2_code  Median_age_persons  Median_tot_prsnl_inc_weekly
0     101021007                  51                          760
1     101021008                  38                          975
2     101021009                  37                          996
3     101021010                  36                         1104
4     101021012                  37                         1357
...         ...                 ...                          ...
2467  901021002                  40                          741
2468  901031003                  38                          585
2469  901041004                  50                          736
2470  997979799                   0                            0
2471  999999499                   0                            0

[2472 rows x 3 columns]

# join

In [48]:
merge1 = pd.merge(consumer_postcode, sa2_code, how='left', on = 'postcode')
merge2 = pd.merge(merge1,income, how = 'left',on='SA2_code')
merge2

,state,postcode,gender,consumer_id,SA2_code,Median_age_persons,Median_tot_prsnl_inc_weekly
0,WA,6935,Female,1195503,504031066.0,40.0,749.0
1,NSW,2782,Female,179208,124011455.0,50.0,740.0
2,NT,862,Female,1194530,702021055.0,26.0,416.0
3,NT,862,Female,1194530,702051066.0,28.0,276.0
4,NT,862,Female,1194530,702021056.0,33.0,671.0
...,...,...,...,...,...,...,...
882478,NSW,2756,Undisclosed,1253484,124041466.0,39.0,790.0
882479,NSW,2756,Undisclosed,1253484,115031300.0,40.0,907.0
882480,NSW,2756,Undisclosed,1253484,115041301.0,39.0,920.0
882481,VIC,3989,Female,175005,NaN,NaN,NaN
882482,NSW,1755,Female,746835,115011290.0,39.0,974.0

In [51]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in c:\users\tommy\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: pandas in c:\users\tommy\anaconda3\lib\site-packages (from pandasql) (1.4.2)
Requirement already satisfied: sqlalchemy in c:\users\tommy\anaconda3\lib\site-packages (from pandasql) (1.4.32)
Requirement already satisfied: pytz>=2020.1 in c:\users\tommy\anaconda3\lib\site-packages (from pandas->pandasql) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\tommy\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\tommy\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\tommy\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26784 sha256=c1cb75292ba3396638c115aeda0303269ed4cb035c4d67d8384a3d1ce1262f00
  Stored in directory: c:\users\tommy\appdata\local\pip\cache\wheels\63\e8\ec\75b1df467ecf57b6ececb32cb16f4e86697cbfe55cb0c51f07
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [53]:
from pandasql import sqldf

query = """
SELECT state, postcode, gender, consumer_id,
avg(Median_age_persons) as mean_age,
avg(Median_tot_prsnl_inc_weekly) as mean_tot_prsnl_inc_weekly

from merge2
group by state, postcode, gender, consumer_id
order by consumer_id

"""


df1 = sqldf(query)

df1

,state,postcode,gender,consumer_id,mean_age,mean_tot_prsnl_inc_weekly
0,QLD,4426,Female,10,42.0,770.0
1,NSW,1040,Female,100,NaN,NaN
2,VIC,3903,Male,1000002,55.0,562.0
3,VIC,3328,Female,1000003,40.0,780.0
4,WA,6513,Male,1000006,45.0,830.0
...,...,...,...,...,...,...
499994,NSW,2402,Female,999993,50.0,533.0
499995,VIC,3231,Male,999994,55.0,881.0
499996,NSW,2535,Female,999995,52.0,783.0
499997,WA,6027,Undisclosed,999997,40.4,889.6
499998,QLD,4107,Female,999998,34.0,903.0